test1 = [
    "Люблю наблюдать за облаками и звездами.",
    "Часто напеваю себе потихоньку.",
    "Не признаю моду, которая неудобна.",
    "Люблю ходить в сауну.",
    "В автомашине цвет для меня имеет значение.",
    "Узнаю по шагам, кто вошел в помещение.",
    "Меня развлекает подражание диалектам.",
    "Внешнему виду придаю серьезное значение.",
    "Мне нравится принимать массаж",
    "Когда есть время, люблю наблюдать за людьми.",
    "Плохо себя чувствую, когда не наслаждаюсь движением.",
    "Видя одежду в витрине, знаю, что мне будет хорошо в ней.",
    "Когда услышу старую мелодию, ко мне возвращается прошлое.",
    "Люблю читать во время еды.",
    "Люблю поговорить по телефону.",
    "У меня есть склонность к полноте.",
    "Предпочитаю слушать рассказ, который кто-то читает, чем читать самому.",
    "После плохого дня мой организм в напряжении.",
    "Охотно и много фотографирую.",
    "Долго помню, что мне сказали приятели или знакомые.",
    "Легко могу отдать деньги за цветы, потому что они украшают жизнь.",
    "Вечером люблю принять горячую ванну.",
    "Стараюсь записывать свои личные дела.",
    "Часто разговариваю с собой.",
    "После длительной езды на машине долго прихожу в себя.",
    "Тембр голоса многое мне говорит о человеке.",
    "Придаю значение манере одеваться, свойственной другим.",
    "Люблю потягиваться, расправлять конечности, разминаться",
    "Слишком твердая или слишком мягкая постель для меня мука.",
    "Мне нелегко найти удобную обувь",
    "Люблю смотреть теле- и видеофильмы.",
    "Даже спустя годы могу узнать лица, которые когда-либо видел.",
    "Люблю ходить под дождем, когда капли стучат по зонтику.",
    "Люблю слушать, когда говорят.",
    "Люблю заниматься подвижным спортом или выполнять какие-либо двигательные упражнения, иногда и потанцевать.",
    "Когда близко тикает будильник, не могу уснуть.",
    "У меня неплохая стереоаппаратура.",
    "Когда слушаю музыку, отбиваю такт ногой.",
    "На отдыхе не люблю осматривать памятники архитектуры.",
    "Не выношу беспорядок.",
    "Не люблю синтетических тканей.",
    "Считаю, что атмосфера в помещении зависит от освещения.",
    "Часто хожу на концерты.",
    "Пожатие руки много говорит мне о данной личности.",
    "Охотно посещаю галереи и выставки.",
    "Серьезная дискуссия – это интересно.",
    "Через прикосновение можно сказать значительно больше, чем словами.",
    "В шуме не могу сосредоточиться."
]

test2 = [
    "Я спокоен.",
    "Мне ничто не угрожает.",
    "Я нахожусь в напряжении.",
    "Я испытываю сожаление.",
    "Я чувствую себя свободно.",
    "Я расстроен.",
    "Меня волнуют возможные неудачи.",
    "Я чувствую себя отдохнувшим.",
    "Я не доволен собой.",
    "Я испытываю чувство внутреннего удовлетворения.",
    "Я уверен в себе.",
    "Я нервничаю.",
    "Я не нахожу себе места.",
    "Я взвинчен.",
    "Я не чувствую скованности, напряженности.",
    "Я доволен.",
    "Я озабочен.",
    "Я слишком возбужден и мне не по себе.",
    "Мне радостно.",
    "Мне приятно.",
    "Я испытываю удовольствие.",
    "Я очень быстро устаю.",
    "Я легко могу заплакать.",
    "Я хотел бы быть таким же счастливым, как и другие.",
    "Нередко я проигрываю из-за того, что недостаточно быстро принимаю решения.",
    "Обычно я чувствую себя бодрым.",
    "Я спокоен, хладнокровен и собран.",
    "Ожидаемые трудности обычно очень тревожат меня.",
    "Я слишком переживаю из-за пустяков.",
    "Я вполне счастлив.",
    "Я принимаю все слишком близко к сердцу.",
    "Мне не хватает уверенности в себе.",
    "Обычно я чувствую себя в безопасности.",
    "Я стараюсь избегать критических ситуаций.",
    "У меня бывает хандра.",
    "Я доволен.",
    "Всякие пустяки отвлекают и волнуют меня.",
    "Я так сильно переживаю свои разочарования, что потом долго не могу о них забыть.",
    "Я уравновешенный человек.",
    "Меня охватывает сильное беспокойство, когда я думаю о своих делах и заботах."
]

test3 = [
    "Я чувствую подавленность.",
    "Утром я чувствую себя лучше всего.",
    "У меня бывают периоды плача или близости к слезам.",
    "У меня плохой ночной сон.",
    "Аппетит к меня хуже обычного.",
    "Мне приятно смотреть на привлекательных женщин, разговаривать с ними, находится рядом.",
    "Я замечаю что теряю вес.",
    "Меня беспокоят запоры.",
    "Сердце бьется быстрее, чем обычно.",
    "Я устаю без всяких причин.",
    "Я мыслю так же ясно, как всегда.",
    "Мне легко делать то, что я умею.",
    "Чувствую беспокойство и не могу усидеть на месте.",
    "У меня есть надежды на будущее.",
    "Я более раздражителен, чем обычно.",
    "Мне легко принимать решения.",
    "Я чувсвую, что полезен и необходим.",
    "Я живу достаточно полной жизнью.",
    "Я чувствую, что другим людям станет лучше, если я умру.",
    "Меня до сих пор радует то, что радовало всегда."
]

test4 = [
    "Самочувствие хорошее - Самочувствие плохое",
    "Чувствую себя сильным",
    "себя слабым",
    "Пассивный - Активный",
    "Малоподвижный - Подвижный",
    "Веселый - Грустный",
    "Хорошее настроение - Плохое настроение",
    "работоспособный - Разбитый",
    "Полный сил - Обессиленный",
    "Медлительный - Быстрый",
    "Бездеятельный - Деятельный",
    "Счастливый - Насчастный",
    "Жизнерадостный - Мрачный",
    "Напряженный - Расслабленный",
    "Здоровый - Больной",
    "Безучастный -Увлеченный",
    "Равнодушный -Взволнованный",
    "Восторженный -Унылый",
    "Радостный -Печальный",
    "Отдохнувший - Усталый",
    "Свежий - Изнуренный",
    "Сонливый - Возбужденный",
    "Желание отдохнуть - Желание работать",
    "Спокойный - Озабоченный",
    "Оптимистичный - Пессимистичный",
    "Выносливый - Утомляемый",
    "Бодрый - Вялый",
    "Соображать трудно - Соображать легко",
    "Рассеянный - Внимательный",
    "Полный надежд - Разочарованный",
    "Довольный - Недовольный"
]

test5 = [
    "Часто ли вы испытываете тягу к новым впечатлениям, чтобы отвлечься, испытать сильные ощущения?",
    "Часто ли вы чувствуете, что нуждаетесь в друзьях, которые могут вас понять, ободрить, выразить сочувствие?",
    "Считаете ли вы себя беззаботным человеком?",
    "Очень ли вам трудно отказываться от своих намерений?",
    "Обдумываете ли вы свои дела не спеша и предпочитаете ли подождать, прежде чем действовать?",
    "Всегда ли вы сдерживаете свои обещания, даже если это вам невыгодно?",
    "Часто ли у вас бывают спады и подъемы настроения?",
    "Быстро ли вы обычно действуете и говорите и не тратите ли много времени на обдумывание?",
    "Возникало ли у вас когданибудь чувство, что вы несчастны, хотя никакой серьезной причины для того не было?",
    "Верно ли, что на спор вы способны решиться на все?",
    "Смущаетесь ли вы, когда хотите познакомиться с человеком противоположного пола, который вам симпатичен?",
    "Бывает ли, что, разозлившись, вы выходите из себя?",
    "Часто ли вы действуете необдуманно, под влиянием момента?",
    "Часто ли вас беспокоят мысли о том, что вам не следовало бы чего-нибудь делать или говорить?",
    "Предпочитаете ли вы чтение книг встречам с людьми?",
    "Верно ли, что вас легко задеть?",
    "Любите ли вы часто бывать в компании?",
    "Бывают ли у вас иногда такие мысли, которыми вам не хотелось бы делиться с другими людьми?",
    "Верно ли, что иногда вы настолько полны энергии, что все горит в руках, а иногда чувствует сильную вялость?",
    "Стараетесь ли вы ограничить круг своих знакомств небольшим числом самых близких людей?",
    "Много ли вы мечтаете?",
    "Когда на вас кричат, отвечаете ли вы тем же?",
    "Часто ли вас терзает чувство вины?",
    "Все ли ваши привычки хороши и желательны?",
    "Способны ли вы дать волю собственным чувствам и вовсю повеселиться в шумной компании?",
    "Можно ли сказать, что нервы у вас часто бывают напряжены до предела?",
    "Считают ли вас человеком живым и веселым?",
    "После того как дело сделано, часто ли вы возвращаетесь к нему мысленно и думаете, что могли бы сделать лучше?",
    "Верно ли, что вы обычно молчаливы и сдержанны, когда находитесь среди людей?",
    "Бывает ли, что вы передаете слухи?",
    "Бывает ли, что вам не спится оттого, что разные мысли лезут вам в голову?",
    "Верно ли, что вам часто приятнее и легче прочесть о том, что вас интересует в книге, хотя можно быстрее и проще узнать об этом у друзей?",
    "Бывает ли у вас сильное сердцебиение?",
    "Нравится ли вам работа, которая требует пристального внимания?",
    "Бывают ли у вас приступы дрожи?",
    "Верно ли, что вы всегда говорите о знакомых вам людях только хорошее, даже тогда, когда уверены, что они об этом не узнают?",
    "Верно ли, что вам неприятно бывать в компании, где постоянно подшучивают друг над другом?",
    "Верно ли, что вы раздражительны?",
    "Нравится ли вам работа, которая требует быстроты действий?",
    "Верно ли, что вам нередко не дают покоя мысли о разных неприятностях и «ужасах», которые могли бы произойти, хотя все кончилось благополучно?",
    "Верно ли, что вы неторопливы в движениях?",
    "Вы когда-нибудь опаздывали на свидание или на работу?",
    "Часто ли вам снятся кошмары?",
    "Верно ли, что вы такой любитель поговорить, что никогда не упустите удобного случая побеседовать с незнакомым человеком?",
    "Беспокоят ли вас какие-нибудь боли?",
    "Огорчились бы вы, если бы долго не могли видеться со своими друзьями?",
    "Можете ли вы назвать себя нервным человеком?",
    "Есть ли среди ваших знакомых такие, которые вам явно не нравятся?",
    "Легко ли вас задевает критика ваших недостатков или вашей работы?",
    "Могли бы вы сказать, что вы уверенный человек?",
    "Трудно ли получить настоящее удовольствие от мероприятий, в которых много участников?",
    "Беспокоит ли вас чувство, что вы чем-то хуже других?",
    "Сумели бы вы внести оживление в скучную компанию?",
    "Бывает ли, что вы говорите о вещах, в которых совсем не разбираетесь?",
    "Беспокоитесь ли вы о своем здоровье?",
    "Любите ли вы подшутить над другими?",
    "Страдаете ли вы бессонницей?"
]

test6 = [
    'Увлеченный',
    'Подавленный',
    'Радостный',
    'Расстроенный',
    'Полный сил',
    'Виноватый',
    'Испуганный',
    'Злой',
    'Заинтересованный',
    'Уверенный',
    'Раздраженный',
    'Сосредоточенный',
    'Стыдящийся',
    'Вдохновленный',
    'Нервный',
    'Решительный',
    'Внимательный',
    'Беспокойный',
    'Бодрый',
    'Тревожный'
]

about_tests = {
    'test1': {
        'name': 'Тест на канал восприятия',
        'info': 'Тест покажет в каком соотношении у вас задействованы аудиальный, визуальный и кинестетический канал восприятия.',
        'questions': test1,
        'image': 'test1.png',
        'instruction':
            """Инструкция к тесту: Прочитайте предлагаемые утверждения.
            Выберите "Да", если Вы согласны с данным утверждением, и "Нет" - если не согласны.
            Необходимо ответить на все вопросы.""",
        'answers': [
            {'name': 'да', 'value': 'yes'},
            {'name': 'нет', 'value': 'no'}
        ]
    },
    'test2': {
        'name': 'Оценка уровня реактивной и личностной тревожности',
        'info': 'Данный тест является надежным и информативным способом самооценки уровня тревожности в данный момент (реактивная тревожность как состояние) и личностной тревожности (как устойчивая характеристика человека).',
        'questions': test2,
        'image': 'test2.jpg',
        'instruction':
            """Инструкция к тесту: Прочитайте внимательно каждое из приведенных ниже предложений и зачеркните соответствующую цифру справа в зависимости от того, как вы себя чувствуете в данный момент.
            Над вопросами долго не задумывайтесь, поскольку правильных или неправильных ответов нет.
            А — Нет, это не так.
            В — Пожалуй, так.
            С — Верно.
            D — Совершенно верно.
            Необходимо ответить на все вопросы.""",
        'answers': [
            {'name': 'A', 'value': '1'},
            {'name': 'B', 'value': '2'},
            {'name': 'C', 'value': '3'},
            {'name': 'D', 'value': '4'}
        ]
    },
    'test3': {
        'name': 'Диагностика психических состояний и свойств личности',
        'info': 'Опросник разработан для дифференциальной диагностики депрессивных состояний и состояний, близких к депрессии, для скриннинг диагностики при массовых исследованиях и в целях предварительной, доврачебной диагностики.',
        'questions': test3,
        'image': 'test3.webp',
        'instruction':
            """Инструкция к тесту: Прочитайте внимательно каждое из приведенных ниже предложений и зачеркните соответствующую цифру справа в зависимости от того, как вы себя чувствуете в последнее время.
                Над вопросами долго не задумывайтесь, поскольку правильных или неправильных ответов нет
            А — никогда или изредка
            В — иногда
            С — часто
            D — почти всегда или постоянно
            Необходимо ответить на все вопросы.""",
        'answers': [
            {'name': 'A', 'value': '1'},
            {'name': 'B', 'value': '2'},
            {'name': 'C', 'value': '3'},
            {'name': 'D', 'value': '4'}
        ]
    },
    'test4': {
        'name': 'Опросник «САН»',
        'info': 'Тест предназначен для оперативной оценки активности, самочувствия и настроения.',
        'questions': test4,
        'image': 'test4.jpg',
        'instruction':
            """Инструкция к тесту: Соотнесите свое состояние с рядом признаков по многоступенчатой шкале.""",
        'answers': [
            {'name': '3', 'value': '1'},
            {'name': '2', 'value': '2'},
            {'name': '1', 'value': '3'},
            {'name': '0', 'value': '4'},
            {'name': '1', 'value': '5'},
            {'name': '2', 'value': '6'},
            {'name': '3', 'value': '7'}
        ]
    },
    'test5': {
        'name': 'Теста Г. Айзенка',
        'info': 'Тест показывает уровень откровенности, экстраверсии (интроверсии) и невротизма.',
        'questions': test5,
        'image': 'test5.jpg',
        'instruction':
            """Инструкция к тесту: Прочитайте предлагаемые утверждения.
            Выберите "Да", если Вы согласны с данным утверждением, и "Нет" - если не согласны.
            Необходимо ответить на все вопросы.""",
        'answers': [
            {'name': 'да', 'value': 'yes'},
            {'name': 'нет', 'value': 'no'}
        ]
    },
    'test6': {
        'name': 'Опросник эмоций',
        'info': 'Этот опросник состоит из перечня прилагательных, которые описывают различные чувства и эмоции.',
        'questions': test6,
        'image': 'test6.jpg',
        'instruction':
            """Этот опросник состоит из перечня прилагательных, которые описывают различные чувства и эмоции.
            Прочитайте каждое прилагательное и отметьте рядом с ним, в какой мере вы чувствовали себя так 
            в течение прошедших нескольких недель. Используйте следующие варианты ответов:
            1 - Почти или совсем нет
            2 - Немного
            3 - Умеренно
            4 - Значительно
            5 - Очень сильно""",
        'answers': [
            {'name': '1', 'value': '1'},
            {'name': '2', 'value': '2'},
            {'name': '3', 'value': '3'},
            {'name': '4', 'value': '4'},
            {'name': '5', 'value': '5'}
        ]
    }
}
